# Python For Data Analysis - Chapter 5 (Pandas)

In [27]:
import numpy as np
import pandas as pd
# Series and DataFrame are heavily used so you may import them directly
from pandas import Series, DataFrame

## 5.1 Introduction to pandas Data Structures

Series, DataFrame.

### Series

In [6]:
ser = Series([4,7,-5,3])
ser

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
ser.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
ser.values

array([ 4,  7, -5,  3])

In [17]:
# we can create Series with custom index
# note that the length of the index must be the same as number of values
# otherwise you'll get an error
custom_idx = Series([4,7,-5,3], index=['d','b','a','c'])
custom_idx

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
custom_idx.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [15]:
custom_idx['a']

-5

In [18]:
# you can also select multiple values by an array of indices
custom_idx[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

#### Series - Use NumPy-like operations

In [22]:
print(custom_idx > 0)
custom_idx[custom_idx > 0]

d     True
b     True
a    False
c     True
dtype: bool

d    4
b    7
c    3
dtype: int64

In [25]:
custom_idx ** 2

d    16
b    49
a    25
c     9
dtype: int64

In [28]:
np.exp(custom_idx)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

#### Using Series as dict

In [31]:
'b' in custom_idx

True

In [32]:
'e' in custom_idx

False

In [125]:
# notice the dict keys are in _sorted_ order
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
states_ser = Series(sdata)
states_ser

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [44]:
# we can override dict keys ordering 
# - notice that 'California' yields NaN and 'Utah' is omitted
states = ['California', 'Ohio', 'Oregon', 'Texas']
states_ser_idx = Series(sdata, index=states)
states_ser_idx

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [46]:
# use isnull and notnull to detect missing/existing data
states_ser_idx.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [47]:
states_ser_idx.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [48]:
states_ser_idx[states_ser_idx.notnull()]

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [49]:
# arithmetic operations work on values matching by index labels
# - it's similar to DB joins
states_ser + states_ser_idx

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [54]:
# Series and its index have 'name' attribute
states_ser_idx.name = 'population'
states_ser_idx.index.name = 'state'
states_ser_idx

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [55]:
# index can be altered
ser.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
ser

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

a rectangular table o data with ordered collection of heterogenous columns.  
Has both row and column index.  
Can be visualized as a **"dict of Series sharing the same index"**.

In [63]:
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year': [2000,2001,2002,2001,2002,2003],
        'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [68]:
# custom columns order
states_pop = DataFrame(data, columns=['year','state','pop'])
states_pop

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [69]:
states_ser

state
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: population, dtype: int64

In [60]:

myframe = DataFrame(states_ser)
myframe

        population
state
Ohio         35000
Texas        71000
Oregon       16000
Utah          5000

In [70]:
# YOu can retrieve a column in a DataFrame as a Series object
# the result have the same index as the DataFrame
states_pop['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [72]:
# You can add a new column
states_pop['debt'] = np.arange(6.)
states_pop

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

#### creating DataFrame from nested dicts

In [74]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
states_pop_nested = DataFrame(pop)
states_pop_nested

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [75]:
# transposed dataframe
states_pop_nested.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [79]:
# DataFrame's index name and columns name

pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
states_pop_nested = DataFrame(pop)

states_pop_nested.index.name = 'year'
states_pop_nested.columns.name = 'state'
states_pop_nested

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

### Index Objects

In [89]:
states_pop_nested.loc[states_pop_nested.index]

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

state  Nevada  Ohio
2001      2.4   1.7
2002      2.9   3.6

## 5.2 Essential functionality

### reindex

In [96]:

s = Series([10,20,30], ['a','b','c'])
s

a    10
b    20
c    30
dtype: int64

In [98]:
s.reindex(['a','b','d'])

a    10.0
b    20.0
d     NaN
dtype: float64

In [102]:
df = DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'], columns=['Ohio','Texas','California'])
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [103]:
df.reindex(columns=['Texas','Utah','California'])

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### drop

In [106]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
# drop rows
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [110]:
# drop columns 
data.drop(['one', 'three'], axis='columns') # or axis=1

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

### Indexing, Selection, and Filter

In [114]:
# select given values from a Series
obj = Series(np.arange(4.), index=['a','b','c','d'])
obj[['a','d']]

a    0.0
d    3.0
dtype: float64

In [116]:
# select by labels - end is inclusive!!!
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [117]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [120]:
# DataFrame - single element or a list selects columns,
# selection syntax [:2] selects rows!
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [122]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int64

In [124]:
data[['one', 'three']]

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### loc and iloc - label-indexing on rows (p. 143)

In [131]:
# let's select single row and multiple columns first
data.loc['Colorado', ['one', 'four']]

one     4
four    7
Name: Colorado, dtype: int64

In [132]:
# ... compare two rows and columns:
data.loc[['Colorado', 'Ohio'], ['one', 'four']]

          one  four
Colorado    4     7
Ohio        0     3

### Arithmetic and Data Alignment

In [134]:
# + of two series will return NaNs where index don't overlap
s1 = Series([7, -2, 3, 1], index=['a','c','d','e'])
s2 = Series([70, -20, 30, 10, 100], index=['a','c','e','f','g'])
s1 + s2

a    77.0
c   -22.0
d     NaN
e    31.0
f     NaN
g     NaN
dtype: float64

In [137]:
# Use fill_value and add method to specify value instead of NaN
s1 = Series([7, -2, 3, 1], index=['a','c','d','e'])
s2 = Series([70, -20, 30, 10, 100], index=['a','c','e','f','g'])
# instead of: s1 + s2
s1.add(s2, fill_value = 0)

a     77.0
c    -22.0
d      3.0
e     31.0
f     10.0
g    100.0
dtype: float64

In [145]:
# broadcastingB - operations between Series and DataFrame
frame = DataFrame(np.arange(12.).reshape((4,3)), 
                  columns=list('bde'), # thi is the same as ['b','d','e']
                  index=['Utah','Ohio','Texas','Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [146]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [147]:
# by default, the arithmetic matches index of the Series on the DataFrame's columns,
# broadcasting down the rows:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

## 5.3 Summary statistisc

In [6]:
import pandas as pd
from pandas import Series, DataFrame
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [20]:
price.describe()

              AAPL          IBM         MSFT         GOOG
count  1257.000000  1257.000000  1257.000000  1257.000000
mean    162.080513   130.040153    87.785009   973.926539
std      58.133154    11.257813    38.824768   230.939391
min      84.962914    93.515839    36.970531   516.830017
25%     109.479942   125.106606    53.677528   766.609985
50%     154.374359   131.393448    80.557732  1016.059998
75%     196.390839   136.284256   110.794128  1155.479980
max     326.316681   157.394867   188.185989  1526.689941

In [7]:
all_data

{'AAPL':                   High         Low        Open       Close      Volume  \
 Date
 2015-05-21  131.630005  129.830002  130.070007  131.389999  39730400.0
 2015-05-22  132.970001  131.399994  131.600006  132.539993  45596000.0
 2015-05-26  132.910004  129.119995  132.600006  129.619995  70697600.0
 2015-05-27  132.259995  130.050003  130.339996  132.039993  45833200.0
 2015-05-28  131.949997  131.100006  131.860001  131.779999  30733300.0
 ...                ...         ...         ...         ...         ...
 2020-05-12  319.690002  310.910004  317.829987  311.410004  40575300.0
 2020-05-13  315.950012  303.209991  312.149994  307.649994  50155600.0
 2020-05-14  309.790009  301.529999  304.510010  309.540009  39732300.0
 2020-05-15  307.899994  300.209991  300.350006  307.709991  41587100.0
 2020-05-18  316.500000  310.320007  313.170013  314.959991  33794600.0

              Adj Close
 Date
 2015-05-21  121.090179
 2015-05-22  122.150032
 2015-05-26  119.458923
 2015-05-27  121.689232
 2015-05-28  121.449577
 ...                ...
 2020-05-12  311.410004
 2020-05-13  307.649994
 2020-05-14  309.540009
 2020-05-15  307.709991
 2020-05-18  314.959991

 [1257 rows x 6 columns],
 'IBM':                   High         Low        Open       Close     Volume  \
 Date
 2015-05-21  174.139999  173.039993  173.320007  173.339996  2295600.0
 2015-05-22  173.389999  172.190002  173.039993  172.220001  2849700.0
 2015-05-26  172.119995  169.130005  172.110001  170.130005  3854200.0
 2015-05-27  172.479996  170.490005  171.160004  172.000000  2764400.0
 2015-05-28  171.839996  170.660004  171.449997  171.710007  1731400.0
 ...                ...         ...         ...         ...        ...
 2020-05-12  124.320000  120.260002  123.010002  120.260002  4784500.0
 2020-05-13  119.989998  114.849998  119.949997  115.730003  5882800.0
 2020-05-14  117.089996  111.809998  114.570000  116.949997  5259400.0
 2020-05-15  117.389999  115.250000  115.930000  116.980003  4786300.0
 2020-05-18  122.360001  119.750000  119.879997  121.559998  4205700.0

              Adj Close
 Date
 2015-05-21  139.470474
 2015-05-22  138.569336
 2015-05-26  136.887711
 2015-05-27  138.392303
 2015-05-28  138.158981
 ...                ...
 2020-05-12  120.260002
 2020-05-13  115.730003
 2020-05-14  116.949997
 2020-05-15  116.980003
 2020-05-18  121.559998

 [1257 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2015-05-21   47.599998   47.009998   47.279999   47.419998  22410700.0
 2015-05-22   47.349998   46.820000   47.299999   46.900002  25720600.0
 2015-05-26   46.880001   46.189999   46.830002   46.590000  29581900.0
 2015-05-27   47.770000   46.619999   46.820000   47.610001  27335600.0
 2015-05-28   48.020000   47.389999   47.500000   47.450001  19283700.0
 ...                ...         ...         ...         ...         ...
 2020-05-12  187.039993  182.300003  186.800003  182.509995  32038200.0
 2020-05-13  184.050003  176.539993  182.550003  179.750000  44711500.0
 2020-05-14  180.690002  175.679993  177.539993  180.529999  41873900.0
 2020-05-15  187.059998  177.000000  179.059998  183.160004  46610400.0
 2020-05-18  186.199997  183.960007  185.750000  184.910004  35264500.0

              Adj Close
 Date
 2015-05-21   43.035767
 2015-05-22   42.563839
 2015-05-26   42.282513
 2015-05-27   43.208202
 2015-05-28   43.062996
 ...                ...
 2020-05-12  182.509995
 2020-05-13  179.750000
 2020-05-14  180.529999
 2020-05-15  183.160004
 2020-05-18  184.910004

 [1257 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close   Volume  \
 Date
 2015-05-21   543.840027   535.979980   537.950012   542.510010  1462700
 2015-05-22   544.190002   539.510010   540.150024   540.109985  1176200
 2015-05-26   539.000000   529.880005   538.119995   532.320007  2406500
 2015-05-27   540.549988   531.710022   532.799988   539.789978  1525000
 2015-05-28   540.609985   536.250000   538.010010   539.780029  1029800
 ...                 ...          ...          ...          ...      ...
 2020-05-12  1415.000000  1374.770020  1407.119995  1375.739990  1390600
 2020-05-13  1385.482056  1328.400024  1377.050049  1349.329956  1812600
 2020-05-14  1357.420044  1323.910034  1335.020020  1356.130005  1603100
 2020-05-15  1374.479980  1339.000000  1350.000000  1373.189941  1707700
 2020-05-18  1392.324951  1354.250000  1361.750000  1383.939941  1822400

               Adj Close
 Date
 2015-05-21   542.510010
 2015-05-22   540.109985
 2015-05-26   532.320007
 2015-05-27   539.789978
 2015-05-28   539.780029
 ...                 ...
 2020-05-12  1375.739990
 2020-05-13  1349.329956
 2020-05-14  1356.130005
 2020-05-15  1373.189941
 2020-05-18  1383.939941

 [1257 rows x 6 columns]}

In [8]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-05-21  121.090179  139.470474   43.035767   542.510010
2015-05-22  122.150032  138.569336   42.563839   540.109985
2015-05-26  119.458923  136.887711   42.282513   532.320007
2015-05-27  121.689232  138.392303   43.208202   539.789978
2015-05-28  121.449577  138.158981   43.062996   539.780029
...                ...         ...         ...          ...
2020-05-12  311.410004  120.260002  182.509995  1375.739990
2020-05-13  307.649994  115.730003  179.750000  1349.329956
2020-05-14  309.540009  116.949997  180.529999  1356.130005
2020-05-15  307.709991  116.980003  183.160004  1373.189941
2020-05-18  314.959991  121.559998  184.910004  1383.939941

[1257 rows x 4 columns]

In [9]:
volume

                  AAPL        IBM        MSFT     GOOG
Date
2015-05-21  39730400.0  2295600.0  22410700.0  1462700
2015-05-22  45596000.0  2849700.0  25720600.0  1176200
2015-05-26  70697600.0  3854200.0  29581900.0  2406500
2015-05-27  45833200.0  2764400.0  27335600.0  1525000
2015-05-28  30733300.0  1731400.0  19283700.0  1029800
...                ...        ...         ...      ...
2020-05-12  40575300.0  4784500.0  32038200.0  1390600
2020-05-13  50155600.0  5882800.0  44711500.0  1812600
2020-05-14  39732300.0  5259400.0  41873900.0  1603100
2020-05-15  41587100.0  4786300.0  46610400.0  1707700
2020-05-18  33794600.0  4205700.0  35264500.0  1822400

[1257 rows x 4 columns]

### Correlation and Covariance

In [12]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-05-12 -0.011428 -0.019006 -0.022652 -0.019611
2020-05-13 -0.012074 -0.037668 -0.015122 -0.019197
2020-05-14  0.006143  0.010542  0.004339  0.005040
2020-05-15 -0.005912  0.000257  0.014568  0.012580
2020-05-18  0.023561  0.039152  0.009554  0.007828

In [15]:
returns['MSFT'].corr(returns['IBM'])

0.5998133279170355

In [16]:
returns['MSFT'].cov(returns['IBM'])

0.00016267779589200303

In [24]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.533643  0.710722  0.642316
IBM   0.533643  1.000000  0.599813  0.529792
MSFT  0.710722  0.599813  1.000000  0.751348
GOOG  0.642316  0.529792  0.751348  1.000000

In [25]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000329  0.000152  0.000222  0.000199
IBM   0.000152  0.000248  0.000163  0.000143
MSFT  0.000222  0.000163  0.000296  0.000222
GOOG  0.000199  0.000143  0.000222  0.000293